# GetEdgesAsCurveLoops Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Face..::..GetEdgesAsCurveLoops Method
Face Class See Also
---
Returns a list of closed curve loops that correspond to the edge loops of the face. Curves in each curve loop correspond to individual edges.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<CurveLoop> GetEdgesAsCurveLoops()
```

Visual Basic
---
```text
Public Function GetEdgesAsCurveLoops As IList(Of CurveLoop)
```

Visual C++
---
```text
public:
IList<CurveLoop^>^ GetEdgesAsCurveLoops()
```

# ### Return Value
A list of closed curve loops, that correspond edges of face.
# Remarks
Orientations of the curves and curve loops match the orientations of the face's edges and edge loops. The order of the CurveLoops should be considered as arbitrary.
# See Also
Face Class
Autodesk.Revit.DB Namespace